/**************************************************************************************
ÉîÛÚÊÐÆÕÖÐ¿Æ¼¼ÓÐÏÞ¹«Ë¾£¨PRECHIN ÆÕÖÐ£©
¼¼ÊõÖ§³Ö£ºwww.prechin.net
PRECHIN
 ÆÕÖÐ

ÊµÑéÃû³Æ£ºDS18B20ÎÂ¶È´«¸ÐÆ÷ÊµÑé
½ÓÏßËµÃ÷£º	
ÊµÑéÏÖÏó£ºÏÂÔØ³ÌÐòºó£¬²åÉÏDS18B20ÎÂ¶È´«¸ÐÆ÷£¬ÊýÂë¹ÜÏÔÊ¾¼ì²âµÄÎÂ¶ÈÖµ
×¢ÒâÊÂÏî£º×¢ÒâÎÂ¶È´«¸ÐÆ÷µÄ·½Ïò£¬ÔÚ½Ó¿Ú´¦ÎÒÃÇÒÑ¾­ÓÃË¿Ó¡»­ÁËÒ»¸öÍ¹Æð£¬
		  ËùÒÔÖ»ÐèÒª½«ÎÂ¶È´«¸ÐÆ÷¶ÔÓ¦²åÈë¼´¿É																				  
***************************************************************************************/
#include "public.h"
#include "ds18b20.h"
#include "lcd1602.h"


/*******************************************************************************
* º¯ Êý Ãû       : main
* º¯Êý¹¦ÄÜ		 : Ö÷º¯Êý
* Êä    Èë       : ÎÞ
* Êä    ³ö    	 : ÎÞ
*******************************************************************************/
void main()
{	
	u8 i=0;
   	int temp_value;
//	u8 temp_buf[5];

	ds18b20_init();//³õÊ¼»¯DS18B20
	lcd1602_init();//³õÊ¼»¯LCD1602
	LcdWriteCom(0x88);	//Ð´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('C'); 

	while(1)
	{				
		i++;
		if(i%50==0)//¼ä¸ôÒ»¶ÎÊ±¼ä¶ÁÈ¡ÎÂ¶ÈÖµ£¬¼ä¸ôÊ±¼äÒª´óÓÚÎÂ¶È´«¸ÐÆ÷×ª»»ÎÂ¶ÈÊ±¼ä
			temp_value=ds18b20_read_temperture()*10;//±£ÁôÎÂ¶ÈÖµÐ¡ÊýºóÒ»Î»
		if(temp_value<0)//¸ºÎÂ¶È
		{
			temp_value=-temp_value;
			LcdWriteData('-');//ÏÔÊ¾¸ººÅ
			//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
			temp=temp-1;
			temp=~temp;
			tp=temp;
			temp=tp*0.0625*100+0.5;	
			//ÁôÁ½¸öÐ¡Êýµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊý×ª»»ÎªÕûÐÍµÄÊ±ºò°ÑÐ¡Êýµã
			//ºóÃæµÄÊý×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ð¡ÓÚ0.5µÄ¾Í
			//ËãÓÉÏ0.5£¬»¹ÊÇÔÚÐ¡ÊýµãºóÃæ¡£	
		}
		else
			LcdWriteData('+');//ÏÔÊ¾Õý
	

	}		
}
